11/data/attachments/47f987200aa5b98.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_bdc7e9cd-193a-40a1-a8be-31e94496bd4f</nif:username>
            <nif:friendToBeAdded>Julie_then_Friend_27351_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>